      E1:     C1 CALL pred if_then_else.main/2-0 (det) if_then_else.m:13
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> break if_then_else.ite
 0: + stop  interface pred if_then_else.ite/2-0 (det)
mdb> continue
      E2:     C2 CALL pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:14)
mdb> finish
      E3:     C2 EXIT pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:14)
mdb> dd -d 3 -n 7
ite(0, 1)
Valid? no
a(0)
Valid? yes
b(1)
Valid? yes
Found incorrect contour:
a(0)
b(1)
ite(0, 1)
Is this a bug? yes
      E3:     C2 EXIT pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:14)
mdb> continue
ite(0, 1).
      E4:     C3 CALL pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:18)
mdb> finish
      E5:     C3 EXIT pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:18)
mdb> dd -d 3 -n 7
ite(1, 0)
Valid? no
Call a(1)
Unsatisfiable? yes
Found incorrect contour:
a(0)
ite(1, 0)
Is this a bug? yes
      E5:     C3 EXIT pred if_then_else.ite/2-0 (det) if_then_else.m:25 (if_then_else.m:18)
mdb> continue
ite(1, 0).
