      E1:     C1 CALL pred io_stream_test.main/2-0 (det) io_stream_test.m:22
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> context none
Contexts will not be printed.
mdb> table_io allow
mdb> table_io start
I/O tabling started.
mdb> break io_stream_test__test
 0: + stop  interface pred io_stream_test.test/4-0 (det)
mdb> continue
      E2:     C2 CALL pred io_stream_test.test/4-0 (det)
mdb> print *
       Stream (arg 1)         	stream(0, input, text, file("tabled_read_decl.data"))
mdb> finish -n
      E3:     C2 EXIT pred io_stream_test.test/4-0 (det)
mdb> print *
       Stream (arg 1)         	stream(0, input, text, file("tabled_read_decl.data"))
       N (arg 2)              	1123
mdb> print
test(stream(0, input, text, file("tabled_read_decl.data")), 1123, _, _)
mdb> dd -d 3 -n 7 -a
test(stream(0, input, text, file("tabled_read_decl.data")), 1123, _, _)
4 tabled IO actions:
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 49)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 50)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 51)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 10)
Valid? print 1-2
stream(0, input, text, file("tabled_read_decl.data"))
1123
dd> p io 1-2
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 49)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 50)
dd> no
test_2(stream(0, input, text, file("tabled_read_decl.data")), 1, 1123, _, _)
4 tabled IO actions:
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 49)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 50)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 51)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 10)
Valid? yes
Found incorrect contour:
test_2(stream(0, input, text, file("tabled_read_decl.data")), 1, 1123, _, _)
4 tabled IO actions:
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 49)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 50)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 51)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 10)
test(stream(0, input, text, file("tabled_read_decl.data")), 1123, _, _)
4 tabled IO actions:
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 49)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 50)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 51)
read_char_code_2(stream(0, input, text, file("tabled_read_decl.data")), 10)
Is this a bug? yes
      E3:     C2 EXIT pred io_stream_test.test/4-0 (det)
mdb> c -n -S
1123
1456
