      E1:     C1  1 CALL pred browser_test.main/2-0 (det) browser_test.m:11
mdb> echo on
Command echo enabled.
mdb> goto 3
      E2:     C2  2 EXIT pred browser_test.big_data/1-0 (det) browser_test.m:18 (browser_test.m:12)
mdb> format pretty
mdb> print *
       Data (arg 1)           	
big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big/3), 6, small))
mdb> format -A verbose
mdb> print *
       Data (arg 1)           	
big
1-big
| 1-big
| | 1-small
| | 2-1

mdb> browse 1; ls; quit
big(
  big(big(small, 1, small), 2, small), 
  3, 
  big(big(small, 4, big(small, 5, small)), 6, small))
mdb> format -AP flat
mdb> print -f 1
       Data (arg 1)           	big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big/3), 6, small))
mdb> print -r 1
       Data (arg 1)           	
big(big(big(...), ...), 3, ...)
mdb> print -v 1
       Data (arg 1)           	
big
1-big
| 1-big
| | 1-small
| | 2-1
| | 3-small
| 2-2
| 3-small
2-3
3-big
  1-big
  | 1-small
  | 2-4
  | 3-big/3
  2-6
  3-small

mdb> print -p 1
       Data (arg 1)           	
big(
  big(big(small, 1, small), 2, small), 
  3, 
  big(big(small, 4, big(small, 5, small)), 6, small))
mdb> print --xyzzy 1
print: unrecognized option: `xyzzy'
mdb: print: usage error -- type `help print' for help.
mdb> browse 1; print; quit
big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big/3), 6, small))
mdb> browse -f 1; ls; quit
big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big(small, 5, small)), 6, small))
mdb> browse Data
browser> ls
big(
  big(big(small, 1, small), 2, small), 
  3, 
  big(big(small, 4, big(small, 5, small)), 6, small))
browser> cd /1
browser> ls
big(big(small, 1, small), 2, small)
browser> cd /1/2
browser> ls
2
browser> cd /3
browser> ls
big(big(small, 4, big(small, 5, small)), 6, small)
browser> cd 1/3/2
browser> ls
5
browser> cd
browser> ls
big(
  big(big(small, 1, small), 2, small), 
  3, 
  big(big(small, 4, big(small, 5, small)), 6, small))
browser> quit
mdb> format_param -A -f depth 1
mdb> print *
       Data (arg 1)           	big(big/3, 3, big/3)
mdb> print Data/1
       Data (arg 1)           	big(big(small, 1, small), 2, small)
mdb> format_param -f depth 3
mdb> print 1
       Data (arg 1)           	big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big/3), 6, small))
mdb> print Data/1/2
       Data (arg 1)           	2
mdb> print 1^1^2^3
mdb: the path 3 does not exist.
mdb> retry
      E3:     C2  2 CALL pred browser_test.big_data/1-0 (det) browser_test.m:18 (browser_test.m:12)
mdb> continue
big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big(small, 5, small)), 6, small))      E5:     C3  2 EXIT pred io.print/3-0 (det) io.m:NNNN (browser_test.m:13)
