      E1:     C1 CALL pred print_goal.main/2-0 (det) print_goal.m:20
mdb> echo on
Command echo enabled.
mdb> context none
Contexts will not be printed.
mdb> register --quiet
mdb> b big_data
 0: + stop  interface pred print_goal.big_data/1-0 (det)
mdb> b print_goal
 1: + stop  interface pred print_goal.print_goal/9-0 (det)
mdb> c
      E2:     C2 CALL pred print_goal.big_data/1-0 (det)
mdb> p goal
big_data(_)
mdb> finish
      E3:     C2 EXIT pred print_goal.big_data/1-0 (det)
mdb> p goal
big_data(big(big(big/3, 2, small), 3, big(big/3, 6, small)))
mdb> c
big(big(big(small, 1, small), 2, small), 3, big(big(small, 4, big(small, 5, small)), 6, small)).
      E4:     C3 CALL pred print_goal.print_goal/9-0 (det)
mdb> v
        1 HeadVar__1
        2 _W (arg 2)
        3 X (arg 3)
        4 Y (arg 6)
mdb> p goal
print_goal(yes, 100, 101, _, _, 102, _, _, _)
mdb> finish
      E5:     C3 EXIT pred print_goal.print_goal/9-0 (det)
mdb> v
        1 HeadVar__1
        2 _W (arg 2)
        3 X (arg 3)
        4 HeadVar__4
        5 HeadVar__5
        6 Y (arg 6)
        7 HeadVar__7
mdb> p goal
print_goal(yes, 100, 101, 102, 103, 102, 103, _, _)
mdb> c
103.
103.
      E6:     C4 CALL pred print_goal.print_goal/9-0 (det)
mdb> v
        1 HeadVar__1
        2 _W (arg 2)
        3 X (arg 3)
        4 Y (arg 6)
mdb> finish
      E7:     C4 EXIT pred print_goal.print_goal/9-0 (det)
mdb> v
        1 HeadVar__1
        2 _W (arg 2)
        3 X (arg 3)
        4 HeadVar__4
        5 HeadVar__5
        6 Y (arg 6)
        7 HeadVar__7
mdb> c
104.
104.
